namespace Collections.Description;

#region Description
/// <summary>
/// هر دولوپری بخش زیادی از عمر خودشو  صرف دیباگ کردم میکنه و اینکه ما بتونیم با توجه به تایپهایی که داریم دولوپ میکنیم
/// اطلاعات مناسب و متناسبی در زمان دیباگ کردن بگیریم خودش برای ما میتونه آورده ی بزرگی باشه،
/// خب دات نت با درک این موضوع یکسری اتربیوت در اختبار ما قرار داده که ما میتونم از این اتریبیوت ها استفاده بکنیم
/// برای اینکه فرایند دیباگ خودمون رو بهینه بکنیم
/// این اتریبیوت ها توی فضای نام : 
/// System.Diagnostics قرار داره
/// [DebuggerDisplay]: 
/// میتونیم بگیم چه اطلاعاتی میخوایم نمایش داده بشه
/// [DebuggerBrowsableState] : 
/// میتونیم تعیین کنیم کدوم یکی از پراپرتی ها و ویژگی هایی که توی تایپمون هستن قابل دیدن باشند
/// [DebuggerTypeProxy] :
/// میتونیم یک پراکسی بنویسیم برای اینکه اون تایپ خودمون رو نمایش بده
/// </summary> 
#endregion
public class DebuggingExperience
{

}
