namespace Collections.Description;
#region Description
/// <summary>
/// اتریبیوت ها یک راهکار خیلی قوی برای اینکه یکسری متا دیتا به  تایپ های خودمون تخصیص بدیم،
/// typeTmethods,peroperties....
/// راهکارش توی سی شارپ و دات نت میشه اتریبیوت ها
///  هر اطلاعات اضافه ای درباره کد ما به کمک اتریبیوت هاقابلیت ایجاد شدن داره و من میتونم از این اطلاعات اضافه جاهای متفاوتی استفاده کنم،
///  میتونم به عنوان داکیومنتیشن ازش استفاده کنم،میتونم زمان کامپایل کد ازش استفاده بکنم، و انواع مختلفی هم داره
///  میتونم خودم شخصا اتریبیوتهایی دولوپ بکنم،یه عالمه هم اتریبیوت توکار هم هست میتونم از اون هم استفاده بکنم
///  این متادیتاهایی که راجبش صحبت میکنید کدهای سی شارپی هستن که کامپایل میشن و همزمان با کد من همه جا وجود دارن
///  استفاده کردن از اتریبیوت رو میگن دکوریت کردن،
/// </summary> 
#endregion
public class Introduction
{

}
