namespace Collections.Description;
#region Description
/// <summary>
/// فرایند اکتشاف تایپهایی هستش که توی برنامه  ما هست تو زمان ران تایم یعنی من تو زمان دولوپ میدونم چه کلاسهایی دارم چه اینترفیسهایی دارم
/// ایونتهایی دارم ورودی ها چیه خروجی ها چیه وقتی دارم کد مینویسم یه عالمه هم اطلاعات از طریق آی دی ای بهم داده میشه و من خیلی راحت کار میکنم
/// و همین اطلعات رو میتونم از طریق رفلکشن در زمان ران تایم هم بدست بیارم ببینیم چه اسمبلی هایی لود شده ببینم داخلش جه تایپهایی هست
/// هر تایپی چه اینترفیسی داره فیلدهاش چیهن،متدهاش خروجی و ورودیش چیه همه این اطلاعات رو میتونم بدست بیارم،
/// بعد از اینکه اکتشاف کردم از این اطلاعات خودم میتونم استفاده بکنم و برم سراغ اینکه تایپهایی که کشف کردم ازش آبجکت بسازم  متدشو کال بکنم،کانستراکتورش رو کال بکنم
/// ما وقتی میریم سراغ رفلکشن دونستن یکسری دیتا تایپها برای ما ضروریه اطلاعاتی که خیلی ضروری هست و ما باید بدونیمشون :
/// Assemly : کلاسی هستش که اطلاعات اسمبلی مارو در اختیار ما قرار میده
/// EventInfo,FieldInfo,MemberInfo,MethodInfo,Moudule,ParameterInfo,PropertyInfo
/// همه ی این کلاس ها کلاسهایی هستن که از ابسترکت کلاس  ممبر اینفو ارث بری کردند
/// </summary> 
#endregion
public class Reflection
{

}
