namespace Attributes.UI.Description
{
    #region Description
    /// <summary>
    /// ببینید وقتی سراغ رفلکشن میریم باید راجب کلاس تایپ بدونیم، عملا وقتی که ما تو فرایند رفلکشن میوفتیم بسیاری از اطلاعاتی که نیاز داریم موقع توسعه نرم افزارمون میتونیم با بدست آوردن یک نمونه از یک تایپ بدست بیاریم
    /// میتون از گت تایپ خود آبجکت استفاده بکنیم،میدونید که همه ی کلاس های دات نتی از آبجکت ارث بری کردند و خود آبجکت هم متدی داره به اسم گت تایپ  که میتونه تایپ
    /// رو به شما برگردونه ولی زمانی میتونید ازش استفاده بکنیم که اینتنس آبجکتتون رو داشته باشید،
    /// گزینه بعدی تایپ آف هستش که نیازه داره که به تایپ ما دسترسی داشته باشه به نوعی که کیخواید تایپشو بدست بیارید دسترسی داشته باشه،ولی خب اینستنس نمیخواد از تایپتون
    /// </summary> 
    #endregion
    public class SystemType
    {
    }
}
