namespace ErrorHandling.Tips
{
    #region Description
    /// <summary>
    /// ببنید ممکنه یک تکه کد خطاهای متفاوتی ایجاد بکنه،و برخورد ما   نسبت به خطاهای متفاوت ممکنه فرق بکنه
    /// مثلا وقتی به دیتابیس میخواید وصل بشید اگه نتونید کانکشن برقرار بکنید یجور رفتار میکنید ،اگر یوذر نیم و پسورد اشتباه
    /// باشه باید یجور دیگه برخورد بکنید،خب خطای کانکشن معمولا موقته،یعنی من میتونم 30 ثانیه صبر بکنم بعد ریترای بکنم
    /// ولی یوذر نیم پسورد اشتباهه نباید ریترای بکنم،پس عملکردم نسبت به خطای مختلف ممکنه فرق بکنه،
    /// و با توجه به این موضوع من میتونم خطاها رو جداگانه دریافت بکنم و هندلشون بکنم
    /// </summary> 
    #endregion
    public class Tips
    {
    }
}
