using Delegates.Delegate;

namespace Delegates.ActionAndFunc
{
    #region Description
    /// <summary>
    /// یک ماجرایی وجود داره اونم اینکه ما به ازای هر سیگنیچری باید بیایم یک دلیگیت ایجاد بکنیم که این باعث میشه کدمون هی بزرگ و بزرگتر بشه
    /// در اینجا مایکروسافت اومد یک راه حل ارائه داد،گفت توابع شما دو حالت داره یا وروی و خروجی داره،یا تنها فرودی داره و خروجی نداره
    /// اگر شما دلیگیتی داشتین که خروجی داشت از 
    /// Func<T>
    /// و اگر تنها ورودی داشت از Action<T>
    /// استفاده کنید،بصورت توکار دلیگیتهای جنریکی ایجاد کرد که 16 تا ورودی میگیرن و میتونی خروجی داشته باشه یا نداشته باشه
    /// </summary> 
    #endregion
    public class ActionAndFunc
    {
        #region Func
        #region Description
        /// <summary>
        /// فانک یک دلیگیته که خروجی داره و 16 تا ورودی میتونه داشته باشه اگر هیچ ورودی نداشته باشه پارامتر اولش نشون دهنده خروجیشه،اما اگه یک ورودی داشته باشه
        /// پارامتر آخرش نوع خروجیش هستش
        /// </summary>
        /// حالا هر تابعی که یک ورودی اینتیجر ورودی بگیره و یک بولین خروجی بده رو میتونم بشه پاس بدم 
        #endregion

        public void GetFunc()
        {
            Func<int, bool> func = ForFunc.IsPersonFullName;
            func(1);
        }
        #endregion
    }
}
