namespace ErrorHandling.Introduction
{
    #region Description
    /// <summary>
    /// Bug :
    /// اشتباه برنامه نویس هستش،یعنی وقتی یک برنامه ای باگ داره یعنی برنامه نویس یجای کار رو اشتباه کرده
    ///  مثلا به شما گفتن سن رو چک کنید که بیشتر از 18 سال باشه اما شما توی شرطتون نوشتید کمتر از 18،این باگه،کد کار میکنه ولی خروجی متفاوته
    ///  User Error :
    ///  کسی که از سیستم استفاده میکنه اشتباه استفاده میکنه بهش گفتیم سن رو وارد کن اسمشو وارد میکنه خب اپ درست کار نمیکنه
    ///  Exeption :
    ///  اون اتفاقاتی هستش که توی کنترل برنامه و برنامه نویس نیست و عملا نباید اتفاق بیوفته،مثلا میخوایم کانکت بشیم به دیتابیس،اما تو اون لحظه ای
    ///  که میخواید وصل بشید دیتابیس کانکت نمیشه
    /// </summary> 
    #endregion
    public class Introduction
    {
    }
}
