namespace Collections.Dictionary
{
    #region Description
    /// <summary>
    /// یک ساختمان دادست که اطلاعات رو به کمک کلید نگهداری میکنه یعنی من یک مجموعه ی کلید و مقدار دارم وصرفا فقط مقدار پاس نمیدم
    /// یک کلید و یک ولیو، به دیکشنری هشتیبل و مپ هم گفته میشه، دلیلش اینه که،ببینید ما یک کلید داریم و به کمک این کلید ما مقدار رو نگهداری میکنیم
    /// عملا ایندکسر ما جنسش متفاوت میشه،جنس میشه جنس کلید من،میتونم بصورت ایندکس باهاش کار بکنم و عناصرم رو تو حافظه پیدا بکنم اما چجوری اینکار رو انجام میده؟
    /// کلید من وقتی که به دیکشنری پاس داده میشه،دیکشنری از این کلید استفاده میکنه و هش کدش رو میگیره،و از این عدده استفاده میکنه برای
    /// اینکه محلی که ولیو باید تو حافظه نگهداری بشه رو محاسبه کنه، میدونم که هش کد نقش مهمی داره برام، و میدونم کلیدم هر نوعی میتونه باشه
    /// ولی تایپ من باید هش کد درستی برگردونه،اگر تایپی که من استفاده میکنم برای کلیدم،هش کد تکراری زیاد برگردونه، یا تایپی که برای کلیدم مشخص میکنم بعد اینکه صداش میزنم اکسپشن ترو بکنه
    /// یا الگوریتمی که هش کد برمیگردونه الگوریتم کندی باشه ،همه ی اینا باعث میشه که عملکرد من توی دیکشنری تحت تاثیر قرار بگیره
    /// و پرفورمنس من بیاد پایین،اگر تمام موارد گفته اوکی باشه،یاعث میشه پرفرمنس خوبیبگیرم توی ثبت و خوندم با استفاده از کلید دیکشنریم
    /// </summary> 
    #endregion
    #region Dictionary
    public class DictionarySample
    {
        Dictionary<string, string> dictionary = new Dictionary<string, string>();

        public void Add(string key, string value)
        {
            if (!dictionary.ContainsKey(key))
                dictionary[key] = value;
        }

        public void Get(string key) => Console.WriteLine(dictionary[key].ToString());

        public void PrintAll()
        {
            foreach (var item in dictionary)
            {
                Console.WriteLine($"{item.Key} - {item.Value}");
            }
        }
    }
    #endregion
}
