namespace ArrayTutorial
{
    #region ArrayDescription
    /// <summary>
    /// یه زمانی ما نیاز داریم که تعداد یک تا بینهایت متغیر از یک جنس داشته باشیم وباهاشون کار بکنیم
    /// مثلا از دیتابیس یک چیزی رو فراخوانی کنیم یا از یک ای پی آی بخوایم یه چیزی رو کال بکنیم ونیاز داریم که تعدادی متغیر از یک جنس 
    /// داشته باشیم تو این شرایط  یک از بهترین راهکارهایی که میتونیم بریم سراغشون آرایه ها هستن،
    /// وقتی میاید از دستورات ساخت آرایه استفاده میکنیم پشت صحنه میره از یک کلاسی استفاده میکنه به اسم 
    /// Array که یک ابسترک کلاس است
    /// با اینکه سی شارپ هستش ولی از یک کلاس دات نتی استفاده میکنه توی بیس کلاس ارری ،مرتب سازی ،پیمایش و .. ایجاد شده
    /// </summary>
    public class ArrayDescription
    {
    } 
    #endregion
}
