namespace Delegates.MultiCastDelegate
{
    #region Description
    /// <summary>
    /// من میتونم داخل یک دلیگیت  بیش از یک متد رو قرار بدم و وقتی که دلیگیتم رو اجرا میکنم تک تک متدهایی که داخل دلیگیتم قرار دادم اجرا میشه
    /// نکته : من وقتی که دلیگیتم رو اجرا میکنم  یک خروجی بهم میده اگر 10 تا متد داخلش باشه چه اتفاقی میوفته؟ خروجی کدمش رو نشون میده؟ بهتره که
    /// دلیگیتهایی که تعریف میکنم در این مورد حتما void باشه
    /// چون من نمیتونم خروجی این متدهایی که داخلش قرار دادم رو بگیرم،اگر بخوام خروجی همشون رو داشته باشم باید بیام
    /// GetInvokatiobList بکنم بعد Foreach بزنم
    /// تا بتونم خروجی تک تکشون رو داشته باشم
    /// وقتی دارید با مالتی کست دلیگیت کار میکنید حتما حواستون به اکسپشن باشه و بدرستی هندلش بکنید
    /// اگه هندلش نکنید تا جایی که اکسپشن رخ نداده کار میکنه از اون به بعد اجرا نمیشه و نیمه کاره رها میشه
    /// </summary> 
    #endregion
    public class MultiCastDelegate
    {
    }
}
