namespace Asp.NetCore.Description
{
    #region HttpRequest
    /// <summary>
    /// ریکوئستی که از http به دستمون میرسه
    /// یک استرینگیه که دوتا قسمت داره هد داره و بادی،و یکسری اطلاعات توی هد هست،که اساسا اطلاعات اضافیه،اطلاعات
    /// دیتایی هستش که قراره به دست ما برسه،و  بادی جریان درخواستی هستش که به دستمون میرسه مثلا فرمیه    
    /// یا اطلاعاتی هست داخل بادی قرار میگیره،اطلاعاتی که توی هد میاد اساسا اطلاعات مهمی هستن،مثلا میگه
    /// contentLenght چقدره
    /// وقتی بادی میاد سمت شما ،شما باید بدونید چقدر قراره که اطلاعات دریافت بکنید
    /// ContentType:
    /// xml داره میاد
    /// json داره میاد 
    /// text
    /// چه اطلاعاتی داره به سمتم میاد رو میگه بهمون،
    /// کوکی هامون داخل httprequest مون هستش
    /// فرمی اگه داریم ارسال میکنیم داخل httprequest هستش 
    /// میتونیم فرم به فرم پردازش بکنیم و اطلاعات رو دریافت بکنیم
    /// اگر ریکوئست https باشه
    /// یک پراپرتی توی 
    /// httprequest هستش که IsHttp هستش
    /// متدمون چیه: get,Post,Put,Path,Query 
    /// </summary> 
    #endregion
    public class HttpRequest
    {

    }
}
