namespace Asp.NetCore.Description
{
    #region Description
    /// <summary>
    /// HttpContext:
    /// یک کلاس نگه دارنده هستش که یکسری اطلاعات رو در خودش حمل میکنه به ازای هر ریکوئست یک اینستنس از این  کلاس ساخته میشه اطلاعات مربوط به ریکوئستمون و اطلاعات مربوط به ریسپانسمون با توجه به شرایط داخل 
    /// این اچ تی تی پی کانکتس نگهداری میشه، این کلاس صرفا اطلاعات ریکوئست و ریسپانس رو نداره ، یکسری اطلاعات زمینه ای هم داخلش هست،مثلا وقتی که یک ریکوئست وب دست ما میرسه یک کانکشنی بین کلاینت و سرور ایجاد میشه
    /// اطلاعات مربوط به اون کانکشن داخل  کانتکس قرار داره،مثلا آی پی که درخواست داده به ما کی بوده، داخل کانکشن هست،ریکوئستمون هست،نشست جاری کاربر داخلش هست،
    /// همون سشن،اطلاعات سشن یکی دیگه از اون اطلاعاتی هستش که داخل کانتکس وجود داره،
    /// اطلاعات کاربر،اسمش چیه،رولش چیه و...و فیچر هم این امکان رو به ما میده که با امکانات بسیار سطح پایین سیستممون کاربکنیم
    /// اینها طلاعاتی هستش که داخل کانتکسمون وجود داره
    /// </summary> 
    #endregion
    public class HttpContext
    {

    }
}
