namespace Asp.NetCore.Description
{
    #region Description
    /// <summary>
    /// کسترل یک وب سرور داخلی ای اس پی دات نت کور هستش،ببینید تا قبل از دات نت کور مایکروسافت وب سروری که داشت اسمش آی آی اس بود، و اپلیکیشن دات نتی هم که
    /// نوشته بود از امکانات آی آی اس استفاده میکرد و یکی از دلایلی که اصلا دات نت نمیتونست کراس پلتفرم باشه همین چسبندگیش به آی آی اس بود،مایکروسافت توی دات نت کور خواست
    /// اینکار رو انجام نده یعنی دیگه وابسته به آی آی اس نباشه برای همین اومد یک وب سروری توسعه داد که این وب سرور بسیار سبکه،کراس پلتفرومه و توانایی این رو داره که تعداد زیادی
    /// درخواست و در لحظه بهشون پاسخ بده،که بصورت توکار داخل اپ ما وجود داره و میاد بالا و درخواستهای وب رو میگیره و شروع میکنه به پردازش کردن
    /// </summary> 
    #endregion
    public class Kestrel
    {

    }
}
