namespace Asp.NetCore.Description
{
    #region Description
    /// <summary>
    /// ببینید یک ریکوئست از طرف کاربر ارسال میشه برای  سرور ما که یک وب سروری ما داریم حالا آآ اس،انجینیکس هستش یا هر چیزی،این ریکوئست رو دریافت میکنه و تحویل اپلیکیشن 
    /// Asp.Net ما میده
    /// اپ ما داخل خودش یک وب سرور داره به اسم کسترل، که این ریکوئست رو دریافت میکنه،و شروع میکنه به پردازش تو مسیر اجرا، حالا وقتی که کسترل ریکوئست رو دریافت میکنه 
    /// HttpContext  رو میسازه و میندازه تو فرایند پردازش
    /// فرایند پردازش توی دات نت ،به وسیله ی یک الگویی پیاده سازی میشه به اسم پایپ لاین،الگوی پایپ لاین میاد میگه که من یک 
    /// مسیر اجرایی دارم که مسیر اجرایی من توسط یکسری قطعات پیاده سازی میشن که این قطعات به ترتیبی که توی مسیر اجرایی قرار گرفته اند ورودی رو دریافت میکنن
    /// و خروجی ایجاد میکنن و تحویل قطعه بعدی میدن توی پایپ لاین این روند قطعه به قطعه جلو میره در نهایت  یک قطعه نهایی داریم که آخرین قطعه تو پایپ لاینمونه،خروجی مرحله قبل خودشو دریافت میکنه پردازش خاص خودش رو انجام میده
    /// ونتیجه رو برمیگردونه،به کی برمیگردونه؟ به مرحله قبل خودش،یعنی درخواست همین مسیری که رفته پردازش شده ،یکبار دیگه بعد از پردازش شدن تو همین مسیر برمیگرده تا میرسه به خروجی،این مسیر رفت و
    /// برگشت رو ما بهش میگیم مسیر اجرایی،پایپ لاین اجرایی، قطعات پازل ما اسمشون چیه؟ اسمشون هست میدلور،که میتونیم یک تا بینهات میدلور داشته باشم
    /// </summary> 
    #endregion
    public class RequestProcessingStepByStep
    {
    }
}
